LAB 02 PANDAS LIBRARY

In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\tesla laptops\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\tesla laptops\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\tesla laptops\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\tesla laptops\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\tesla laptops\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\tesla laptops\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import numpy as np
import pandas as pd

Pandas helps read and manipulate data files

# Series
Series is a single column list

## Dataframe
Dataframe is a 2D table. This will be used more for adding and deleting rows and columns. Dataframe is a collection of series

In [3]:
s1 = pd.Series([1,2,4,-3]) # if I give differnt data types, then it will be assigned Object datatype
s1

0    1
1    2
2    4
3   -3
dtype: int64

In [4]:
s2 = pd.Series([1,2,'bob the builder',-3]) # if I give differnt data types, then it will be assigned Object datatype
s2

0                  1
1                  2
2    bob the builder
3                 -3
dtype: object

In [5]:
s1

0    1
1    2
2    4
3   -3
dtype: int64

In [6]:
s1[3] = -7
s1

0    1
1    2
2    4
3   -7
dtype: int64

In [7]:
s1.values # returns nd array, it's an attribute

array([ 1,  2,  4, -7], dtype=int64)

In [9]:
s1.index   # returns range object

RangeIndex(start=0, stop=4, step=1)

In [11]:
s2 = pd.Series([4,7,5,0], index= ['a', 'b', 'c', 'd'])
s2

a    4
b    7
c    5
d    0
dtype: int64

In [12]:
s2['a']

4

In [14]:
s2[0]

C:\Users\Tesla Laptops\AppData\Local\Temp\ipykernel_1256\2344841457.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[0]

4

In [16]:
s2[['a', 'd']]

a    4
d    0
dtype: int64

In [17]:
# boolean filtering
s2[s2>0]

a    4
b    7
c    5
dtype: int64

In [18]:
s1

0    1
1    2
2    4
3   -7
dtype: int64

In [19]:
s1*2

0     2
1     4
2     8
3   -14
dtype: int64

In [23]:
s1

0    1
1    2
2    4
3   -7
dtype: int64

In [24]:
np.sqrt(s1[s1>0]) # numpy accepts both series and dataframe

0    1.000000
1    1.414214
2    2.000000
dtype: float64

In [25]:
s3 = pd.Series( {'Ohio': 3240, 'Texas': 4320, 'Oregon': 6790, 'Utah': 8907}) # treats keys as indices and values as, well, values :)
s3

Ohio      3240
Texas     4320
Oregon    6790
Utah      8907
dtype: int64

In [30]:
l1 = ['Ohio','Texas','Oregon', 'Utah']  # keys
l2 = [3240, 4320, 6790, 8907]           # values
s4 = pd.Series(l2, index=l1) # if I don't give index, then default index will be assigned
s4                           # if values are not given,  Nan will be given

Ohio      3240
Texas     4320
Oregon    6790
Utah      8907
dtype: int64

In [31]:
s4.name = 'Population'
s4.index.name  = 'State'
s4

State
Ohio      3240
Texas     4320
Oregon    6790
Utah      8907
Name: Population, dtype: int64

# Dataframe

In [37]:
df1 = pd.DataFrame({ 'state': ['Ohio', 'Ohio', 'Nevada', 'Utah'],
         'year': [2004,2001,2004,2005],
         'pop': [1.5, 1.7, 1.6, 1.1]})
df1

    state  year  pop
0    Ohio  2004  1.5
1    Ohio  2001  1.7
2  Nevada  2004  1.6
3    Utah  2005  1.1

In [39]:
df2 = pd.DataFrame({ 'state': ['Ohio', 'Ohio', 'Nevada', 'Utah'],
         'year': [2004,2001,2004,2005],
         'pop': [1.5, 1.7, 1.6, 1.1]}, columns = ['year', 'state', 'pop']) # Changing names of columns
df2

   year   state  pop
0  2004    Ohio  1.5
1  2001    Ohio  1.7
2  2004  Nevada  1.6
3  2005    Utah  1.1

In [41]:
df3 = pd.DataFrame({ 'state': ['Ohio', 'Ohio', 'Nevada', 'Utah'],
         'year': [2004,2001,2004,2005],
         'pop': [1.5, 1.7, 1.6, 1.1]}, index=['a', 'b', 'c', 'd'])
df3

    state  year  pop
a    Ohio  2004  1.5
b    Ohio  2001  1.7
c  Nevada  2004  1.6
d    Utah  2005  1.1

While indexing, we can extract columns as series or sub-dataframe.

In [42]:
df3.year        # df3['year']

a    2004
b    2001
c    2004
d    2005
Name: year, dtype: int64

In [45]:
df4 = df3[['year']] # retrieves columns as Dataframe using double square brackets
df4

   year   state
a  2004    Ohio
b  2001    Ohio
c  2004  Nevada
d  2005    Utah

In [46]:
df4 = df3[['year', 'state']] # retrieves columns as Dataframe using double square brackets
df4

   year   state
a  2004    Ohio
b  2001    Ohio
c  2004  Nevada
d  2005    Utah

# Now, we extract rows using loc(for non-numeric indices) and iloc(for numeric indices)

In [47]:
df3.loc['d'] # converts as series but can extract only one row

state    Utah
year     2005
pop       1.1
Name: d, dtype: object

In [48]:
df3.year.loc['d'] # extracts single value, first accessing column then year

2005

In [49]:
df3.loc['d'].year # first accessing row then column

2005

In [50]:
df3.iloc[2] # all non-numeric indices are also hashed to numeric values

state    Nevada
year       2004
pop         1.6
Name: c, dtype: object

In [51]:
df1

    state  year  pop
0    Ohio  2004  1.5
1    Ohio  2001  1.7
2  Nevada  2004  1.6
3    Utah  2005  1.1

In [52]:
df1.loc[2]

state    Nevada
year       2004
pop         1.6
Name: 2, dtype: object

In [58]:
df3['debt'] = 0 # Adds or modifies all the values of column
df3

    state  year  pop  debt
a    Ohio  2004  1.5     0
b    Ohio  2001  1.7     0
c  Nevada  2004  1.6     0
d    Utah  2005  1.1     0

Axis 0 is top to bottom<br/>
Axis 1 is left to right

In [59]:
obj = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [60]:
val = obj.drop('e') # does not alter/modify original series/dataframe
# deletes entire row by default while seraching vertically for index name, 
# if axis=1 then delets column while seraching in the headers of column
val # New modified table is returned

a    0
b    1
c    2
d    3
dtype: int32

In [61]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32